Autodesk.Revit.DB.FamilyUtils.FamilyCanConvertToFaceHostBased(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates whether the family can be converted to face host based.
document:
The document.
familyId:
The element id of the family.
Returns:
True if the family can be converted to face-based.
Otherwise false, which will be returned if there any family instances exist in the project, the family is already face-based, or the family does not have a host.
Also, false is returned if the family does not belong to one of the following categories:
OST_CommunicationDevicesOST_DataDevicesOST_DuctTerminalOST_ElectricalEquipmentOST_ElectricalFixturesOST_FireAlarmDevicesOST_LightingDevicesOST_LightingFixturesOST_MechanicalEquipmentOST_NurseCallDevicesOST_PlumbingFixturesOST_SecurityDevicesOST_SprinklersOST_TelephoneDevices
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null